/*ДЗ 1

Вам необхідно намалювати в консолі прямокутний трикутник із зірочок (або плюсиків, або якогось іншого символу):
на першому рядку - одна зірочка, на другій дві, і так далі. Рішення оформіть у вигляді функції,
куди передаються два параметри: висота трикутника та символ, яким його потрібно "малювати".*/
// 1 РЕАЛІЗАЦІЯ
let b = "*"
let c = "*";
function first() {
    for (let i = 0; i < 5; i++) {
        console.log(c);
        c+=b;
    }
}
first()

//2 РЕАЛІЗАЦІЯ
let p = "*"
let t = 1;
do {
   t = t + 1;
   console.log(p);
    p += p;
} while (t <= 5);


// ДЗ 2
//
//  Вивести на екран суму чисел від 1 до 100 включно, які не кратні 3.
let sum = 0;
function test (){
    for (let i = 1; i <= 100; i++) {
      if (i % 3 === 0) continue
        sum +=i ;

 }
     console.log(sum);
}
test()

// ДЗ 3:
//
// Написати функцію pow(x,y) яка буде приймати 2 числа, перше це число яке ми будемо зводити у ступінь, друге у яку ступінь.
// Наприклад pow(2,3) функція поверне значення 8.
//
// Умови виконання ДЗ
// Не використовувати **


// 1 Реалізація
let base = Math.pow (3, 4);
console.log(base)
//
// 2 Реалізація
let sun = 2;
let moon = 3;
let chase = Math.pow (sun, moon );

 console.log(chase);
// 3 реалізація, Динамічна.

let point = 3;
for (let i = 2; i <= 10; i++){
console.log(Math.pow (i,point))
}

